app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "meeting"], ["start", "2023-02-10 11:22:00"], ["end", "2023-02-10 00:22:00"], ["created_at", "2023-02-10 17:22:28.749391"], ["updated_at", "2023-02-10 17:22:28.749391"]]