app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "LoveWorld"], ["description", "our team"], ["created_at", "2023-02-10 17:21:51.856603"], ["updated_at", "2023-02-10 17:21:51.856603"]]