app/controllers/group_members_controller.rb

  def index
    @group_members = GroupMember.all
---
SELECT "group_members".* FROM "group_members"

  def create
    @group_member = GroupMember.new(group_member_params)

    respond_to do |format|
      if @group_member.save
---
INSERT INTO "group_members" ("group_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 2], ["user_id", 2], ["created_at", "2023-02-10 17:23:19.623679"], ["updated_at", "2023-02-10 17:23:19.623679"]]

  def set_group_member
    @group_member = GroupMember.find(params[:id])
---
SELECT "group_members".* FROM "group_members" WHERE "group_members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]