app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("full_name", "email", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["full_name", "Brandon Longuet"], ["email", "brandon@tamu.edu"], ["phone_number", "0001112222"], ["created_at", "2023-02-10 17:21:38.436692"], ["updated_at", "2023-02-10 17:21:38.436692"]]